Config/ExchangePlans/ОбменБГУ2_БГУ2_ГИСГМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>ОбменБГУ2_БГУ2_ГИСГМП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Config/ExchangePlans/ОбменБГУ2_БГУ2_ГИСГМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена = Ложь;
	
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Истина; 
	
	//задаем явно, чтобы совпали настройки ИмяКонфигурацииИсточника нашей базы и ИмяКонфигурацииПриемника другой базы, 
	//чтобы обмен работал в облаке и для КОРП конфигурации
	Настройки.ИмяКонфигурацииИсточника = "БухгалтерияГосударственногоУчреждения";  
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
	Настройки.Алгоритмы.ОписаниеОграниченийПередачиДанных = Истина;
	
	Настройки.ИмяКонфигурацииПриемника.Вставить("БухгалтерияГосударственногоУчреждения", Неопределено);
	Настройки.ИмяКонфигурацииПриемника.Вставить("БухгалтерияГосударственногоУчрежденияКОРП", Неопределено);//на всякий случай, чтобы работало, если есть не обновленные базы
	
	Настройки.ФорматОбмена = "ОбменБГУ2_БГУ2_ГИСГМП"; 

КонецПроцедуры
	
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	ТекБазаГАН = ПолучитьФункциональнуюОпцию("ЭтоБазаГАН");
	
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = НСтр("ru = 'Между базой ГАН и базой АН конфигурации БГУ ред. 2.0 для взаимодействия с ГИС ГМП'");
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = ?(ТекБазаГАН, Нстр("ru='База АН (БГУ 2.0)'"),Нстр("ru='База ГАН (БГУ 2.0)'"));
	ОписаниеВарианта.ИмяКонфигурацииКорреспондента = "БухгалтерияГосударственногоУчреждения";
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена = НСтр("ru = 'Настройка синхронизации данных с базой "+?(ТекБазаГАН,"ГАН","АН")+"'");
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = НСтр("ru = 'Настройки обмена для БГУ 2.0 (АН)'");
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ОбщегоНазначенияБГУ.ИспользуемыеТранспортыСообщенийОбмена();
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = НСтр("ru = 'Позволяет выполнять обмен данными для взаимодействия АН с ГИС ГМП через ГАН.'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.ОбменБГУ2_БГУ2_ГИСГМП.Форма.ПодробнаяИнформация";
	ОписаниеВарианта.ПояснениеДляНастройкиПараметровУчета = НСтр("ru = '	Перед выполнением обмена необходимо выполнить настройку информационной базы в соответствии с инструкцией по настройке БГУ ред. 2.0 
	|для взаимодействия с ГИС ГМП для Главного администратора начислений, а также создать контрагентов-администраторов начислений с которыми предполагается выполнять обмен в справочнике ""Контрагенты"" 
	|с признаком ""Администратор начислений"" и заполнить у них реквизиты ИНН и КПП.
	|Это необходимо для корректного обмена документами.'"); 
	
КонецПроцедуры

#Область Обработчики

// Возвращает строку описания ограничений миграции данных для пользователя;
// Прикладной разработчик на основе установленных отборов на узле должен сформировать строку описания ограничений 
// удобную для восприятия пользователем.
// 
// Параметры:
//  НастройкаОтборовНаУзле - Структура - структура отборов на узле плана обмена,
//                                       полученная при помощи функции НастройкаОтборовНаУзле().
// 
// Возвращаемое значение:
//  Строка, Неогранич. - строка описания ограничений миграции данных для пользователя
//
Функция ОписаниеОграниченийПередачиДанных(НастройкаОтборовНаУзле, ВерсияКорреспондента, ИдентификаторНастройки) Экспорт
	
	ОграничениеДатаНачалаВыгрузкиДокументов = "";
	
	// дата начала выгрузки документов
	Если ЗначениеЗаполнено(НастройкаОтборовНаУзле.ДатаНачалаВыгрузкиДокументов) Тогда
		
		// "Выгружать документы, начиная с 1 января 2009г."
		ОграничениеДатаНачалаВыгрузкиДокументов = НСтр("ru = 'Начиная с [ДатаНачалаВыгрузкиДокументов]'");
		ОграничениеДатаНачалаВыгрузкиДокументов = СтрЗаменить(ОграничениеДатаНачалаВыгрузкиДокументов, "[ДатаНачалаВыгрузкиДокументов]", Формат(НастройкаОтборовНаУзле.ДатаНачалаВыгрузкиДокументов, "ДЛФ=DD"));
		
	Иначе
		
		ОграничениеДатаНачалаВыгрузкиДокументов = НСтр("ru = 'За весь период ведения учета в программе'");
		
	КонецЕсли;

	Если НастройкаОтборовНаУзле.ИспользоватьОтборПоОрганизациям Тогда 
		СтрокаПредставленияОтбораОрг = СтрСоединить(НастройкаОтборовНаУзле.Организации.Организация, "; ");

		НСтрока = НСтр("ru = 'Только по организациям: %1'");
		//|По контрагентам: %2
		//|"+ОграничениеДатаНачалаВыгрузкиДокументов+"'");
		
		ОграничениеОтбор = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, СтрокаПредставленияОтбораОрг);
		//, СтрокаПредставленияОтбораКонтрагенты
		//Возврат ОграничениеОтбор;
	Иначе
		НСтрока = НСтр("ru = 'По всем организациям.'");
		//|По контрагентам: %1
		//|"+ОграничениеДатаНачалаВыгрузкиДокументов+"'");
		
		ОграничениеОтбор = НСтрока;
		//СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, СтрокаПредставленияОтбораКонтрагенты);

		//Возврат ОграничениеОтбор;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ЭтоБазаГАН") Тогда
		
		СтрокаПредставленияОтбораКонтрагенты = СтрСоединить(НастройкаОтборовНаУзле.Контрагенты.Контрагент, "; ");
		
		ОграничениеОтбор = ОграничениеОтбор + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("'По контрагентам: %1'"),СтрокаПредставленияОтбораКонтрагенты);
	КонецЕсли;
	
	ОграничениеОтбор = ОграничениеОтбор + Символы.ПС + ОграничениеДатаНачалаВыгрузкиДокументов;
	
	Возврат ОграничениеОтбор;
	
КонецФункции

// Возвращает строку описания ограничений миграции данных для базы корреспондента, которая отображается пользователю;
// Прикладной разработчик на основе установленных отборов на узле базы корреспондента должен сформировать строку описания ограничений 
// удобную для восприятия пользователем.
// 
// Параметры:
//  НастройкаОтборовНаУзле - Структура - структура отборов на узле плана обмена базы корреспондента,
//                                       полученная при помощи функции НастройкаОтборовНаУзлеБазыКорреспондента().
// 
// Возвращаемое значение:
//  Строка, Неогранич. - строка описания ограничений миграции данных для пользователя
//
Функция ОписаниеОграниченийПередачиДанныхБазыКорреспондента(НастройкаОтборовНаУзле, ВерсияКорреспондента, ИдентификаторНастройки) Экспорт
	
	ОграничениеДатаНачалаВыгрузкиДокументов = "";
	ОграничениеОтборПоОрганизациям = "";
	
	// дата начала выгрузки документов
	Если ЗначениеЗаполнено(НастройкаОтборовНаУзле.ДатаНачалаВыгрузкиДокументов) Тогда
		
		// "Выгружать документы, начиная с 1 января 2009г."
		ОграничениеДатаНачалаВыгрузкиДокументов = НСтр("ru = 'Начиная с [ДатаНачалаВыгрузкиДокументов]'");
		ОграничениеДатаНачалаВыгрузкиДокументов = СтрЗаменить(ОграничениеДатаНачалаВыгрузкиДокументов, "[ДатаНачалаВыгрузкиДокументов]", Формат(НастройкаОтборовНаУзле.ДатаНачалаВыгрузкиДокументов, "ДЛФ=DD"));
		
	Иначе
		
		ОграничениеДатаНачалаВыгрузкиДокументов = "За весь период ведения учета в программе";
		
	КонецЕсли;
	
	// отбор по организациям
	Если НастройкаОтборовНаУзле.ИспользоватьОтборПоОрганизациям Тогда
		
		СтрокаПредставленияОтбора = СтрСоединить(НастройкаОтборовНаУзле.Организации.Организация, "; ");
		
		ОграничениеОтборПоОрганизациям = НСтр("ru = 'Только по организациям: [СтрокаПредставленияОтбора]'");
		ОграничениеОтборПоОрганизациям = СтрЗаменить(ОграничениеОтборПоОрганизациям, "[СтрокаПредставленияОтбора]", СтрокаПредставленияОтбора);
		
	Иначе
		
		ОграничениеОтборПоОрганизациям = НСтр("ru = 'По всем организациям'");
		
	КонецЕсли;
	
	Результат = НСтр("ru = 'Выгружать документы и справочную информацию:
						|[ОграничениеДатаНачалаВыгрузкиДокументов]
						|[ОграничениеОтборПоОрганизациям]'");
		
	//
	
	Результат = СтрЗаменить(Результат, "[ОграничениеДатаНачалаВыгрузкиДокументов]", ОграничениеДатаНачалаВыгрузкиДокументов);
	Результат = СтрЗаменить(Результат, "[ОграничениеОтборПоОрганизациям]",          ОграничениеОтборПоОрганизациям);
	
	Возврат Результат;	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру отборов на узле плана обмена с установленными значениями по умолчанию;
// Структура настроек повторяет состав реквизитов шапки и табличных частей плана обмена;
// Для реквизитов шапки используются аналогичные по ключу и значению элементы структуры,
// а для табличных частей используются структуры,
// содержащие массивы значений полей табличных частей плана обмена.
// 
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура - структура отборов на узле плана обмена
// 
Функция НастройкаОтборовНаУзле() Экспорт
	
	СтруктураТабличнойЧастиОрганизации = Новый Структура;
	СтруктураТабличнойЧастиОрганизации.Вставить("Организация", Новый Массив);
	
	СтруктураТабличнойЧастиКонтрагенты = Новый Структура;
	СтруктураТабличнойЧастиКонтрагенты.Вставить("Контрагент", Новый Массив);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИспользоватьОтборПоОрганизациям", Ложь);
	СтруктураНастроек.Вставить("ДатаНачалаВыгрузкиДокументов", '00010101');
	СтруктураНастроек.Вставить("Контрагенты", СтруктураТабличнойЧастиКонтрагенты);
	СтруктураНастроек.Вставить("Организации", СтруктураТабличнойЧастиОрганизации);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Возвращает структуру отборов на узле плана обмена базы корреспондента с установленными значениями по умолчанию;
// Структура настроек повторяет состав реквизитов шапки и табличных частей плана обмена базы корреспондента;
// Для реквизитов шапки используются аналогичные по ключу и значению элементы структуры,
// а для табличных частей используются структуры,
// содержащие массивы значений полей табличных частей плана обмена.
// 
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура - структура отборов на узле плана обмена базы корреспондента
// 
Функция НастройкаОтборовНаУзлеБазыКорреспондента() Экспорт
	
	СтруктураТабличнойЧастиОрганизации = Новый Структура;
	СтруктураТабличнойЧастиОрганизации.Вставить("Организация", Новый Массив);
	СтруктураТабличнойЧастиОрганизации.Вставить("Организация_Ключ", Новый Массив);
		
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИспользоватьОтборПоОрганизациям", Ложь);
	СтруктураНастроек.Вставить("ДатаНачалаВыгрузкиДокументов", '00010101');
	СтруктураНастроек.Вставить("Организации", СтруктураТабличнойЧастиОрганизации);
		
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецОбласти

#КонецЕсли
